Revit 2024 API
TextNode.VerticalAlignment Property
 Indicates default vertical alignment of the text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public VerticalTextAlignment VerticalAlignment { get; }
Visual Basic
Public ReadOnly Property VerticalAlignment As VerticalTextAlignment
	Get
Visual C++
public:
property VerticalTextAlignment VerticalAlignment {
	VerticalTextAlignment get ();
}
See Also
TextNode Class
Autodesk.Revit.DB Namespace